<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.install.saits.Firefox_ESR</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>SAITS</string>
            <key>POLICY_CATEGORY</key>
            <string>Browsers</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/../Firefox/UITS-Install-Firefox_ESR-PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/../Firefox/Firefox.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/../Firefox/UITS-Install-Firefox_ESR-SmartGroupTemplate.xml</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.darklordbrock.jss.install.default.Firefox_ESR</string>
    </dict>
</plist>
