<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.update.default.Firefox_ESR</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>SA</string>
            <key>POLICY_CATEGORY</key>
            <string>Updates</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/../Firefox/SAITS-Update-Firefox_ESR-PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/../Firefox/Firefox.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/../Firefox/Firefox/SAITS-Update-Firefox_ESR-SmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string>Web Browser</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.darklordbrock.jss.install.default.Firefox_ESR</string>
    </dict>
</plist>
