<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Silverlight installer and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.Silverlight</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Silverlight</string>
      <key>CATEGORY</key>
      <string>AutoPkgr</string>
      <key>version</key>
      <string>%version%</string>
      <key>VENDER</key>
      <string>Microsoft</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.Silverlight</string>
  <key>Process</key>
      <array>
          <dict>
            <key>Arguments</key>
              <dict>
              <key>prod_name</key>
              <string>%NAME%</string>
              <key>category</key>
              <string>%CATEGORY%</string>
              </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
          </dict>
      </array>
</dict>
</plist>
