<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.uits.Office2011Updates</string>
    <key>Input</key>
    <dict>
        <key>SCOPE</key>
        <string>All-8Auto-</string>
        <key>VENDER</key>
        <string>Microsoft-</string>
        <key>NAME</key>
        <string>Office2011Update</string>
        <key>CATEGORY</key>
        <string>AutoPkgr</string>
        <key>VERSION</key>
        <string>latest</string>
        <key>CULTURE_CODE</key>
        <string>0409</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.Office2011Updates</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/%pkg_name%</string>
                <key>pkg_path</key>
                <string>%SCOPE%%VENDER%%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
        </dict>
        <key>Processor</key>
        <string>JSSImporter</string>
    </dict>
    </array>
</dict>
</plist>
