<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string></string>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.install.uits.Numbers</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>UITS</string>
            <key>CATEGORY</key>
            <string>AutoPkgr</string>
            <key>POLICY_CATEGORY</key>
            <string>Office</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates-default/UWM-Install-PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/icons/Numbers.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates-default/UWM-Install-SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>%NAME%</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.scriptingosx.pkg.Numbers_</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
