<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Oracle Java 8 JRE and copies out the flat installer pkg
within, appending the version number to the filename. (Note the version of the actual
pkg id for the com.oracle.jre pkg component is still always "1.0".)

To use this recipe, you must accept the Oracle Binary Code License Agreement for Java SE.
http://www.oracle.com/technetwork/java/javase/terms/license/index.html
 Then, uploads to the JSS.</string>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.update.uits.OracleJava8</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>UITS</string>
            <key>NAME</key>
            <string>OracleJava8</string>
            <key>PKG_ID</key>
            <string>com.oracle.jre</string>
            <key>CATEGORY</key>
            <string>AutoPkgr</string>
            <key>POLICY_CATEGORY</key>
            <string>Plug-ins</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Templates-default/UWM-Update-PolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/icons/OracleJava8.png</string>
            <key>GROUP_NAME</key>
            <string>%NAME%</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/OrcaleJava8/UITS-Update-Java8-SmartGroupTemplate.xml</string>
            <key>DESCRIPTION</key>
            <string></string>
            <!--PlistReader w/o variable injection in AutoPkg requires this-->
            <key>version</key>
            <string/>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>
        <key>ParentRecipe</key>
        <string>com.github.autopkg.pkg.OracleJava8</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
