<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Silverlight installer and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.uits.Silverlight</string>
    <key>Input</key>
    <dict>
      <key>SCOPE</key>
      <string>All-8Auto-</string>
      <key>VENDER</key>
      <string>Microsoft-</string>
      <key>NAME</key>
      <string>Silverlight</string>
      <key>CATEGORY</key>
      <string>AutoPkgr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Silverlight</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Silverlight.pkg/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/Silverlight.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%SCOPE%VENDER%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
        <dict>
          <key>Arguments</key>
            <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
            </dict>
          <key>Processor</key>
          <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
