<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest TextWrangler and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.uits.TextWrangler</string>
    <key>Input</key>
    <dict>
      <key>SCOPE</key>
      <string>All-8Auto-</string>
      <key>VENDER</key>
      <string>BareBones-</string>
      <key>NAME</key>
      <string>TextWrangler</string>
      <key>CATEGORY</key>
      <string>AutoPkgr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.textwrangler</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%/TextWrangler.app</string>
                <key>destination_path</key>
                <string>%pkgroot%/Applications/TextWrangler.app</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%SCOPE%%VENDER%%NAME%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.barebones.textwrangler.pkg</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>scripts</key>
                    <string>TextWrangler_Scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
    				<key>Arguments</key>
    				<dict>
    						<key>prod_name</key>
    						<string>%NAME%</string>
    						<key>category</key>
    						<string>%CATEGORY%</string>
    						<key>self_service_icon</key>
    						<string>%ICON%</string>
    						<key>self_service_description</key>
    						<string>%DESCRIPTION%</string>
    				</dict>
    				<key>Processor</key>
    				<string>JSSImporter</string>
    		</dict>
    </array>
</dict>
</plist>
