<policy>
    <general>
        <site>
          <name>%SITE_NAME%</name>
        </site>
        <name>%NAME% %SITE_NAME%</name>
        <enabled>true</enabled>
        <frequency>Once every week</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <trigger_other>%SITE_NAME%-%NAME%-install</trigger_other>
    </general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
      <script>
        <name>UITS-Firefox_ESR_Settings.sh</name>
        <priority>After</priority>
        <parameter4/>
        <parameter5/>
        <parameter6/>
        <parameter7/>
        <parameter8/>
        <parameter9/>
        <parameter10/>
        <parameter11/>
      </script>
    </scripts>
    <self_service>
      <use_for_self_service>true</use_for_self_service>
      <install_button_text>Install %VERSION%</install_button_text>
      <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
      <!--<self_service_categories>
        <category>
          <name>AutoPkgr</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories> -->
    </self_service>
</policy>
