<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest VLC disk image and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.uits.VLC</string>
    <key>Input</key>
    <dict>
      <key>Vender</key>
      <string>VideoLAN</string>
      <key>NAME</key>
      <string>VLC</string>
      <key>CATEGORY</key>
      <string>AutoPkgr</string>
      <key>ICON</key>
      <string>%RECIPE_DIR%/icons/VLC.png</string>
      <key>DESCRIPTION</key>
      <string>VLC is a free and open source cross-platform multimedia player and framework that plays most multimedia files as well as DVDs, Audio CDs, VCDs, and various streaming protocols.</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.VLC</string>
    <key>Process</key>
    <array>
        <dict>
        <key>Arguments</key>
          <dict>
            <key>prod_name</key>
            <string>%NAME%</string>
            <key>category</key>
            <string>%CATEGORY%</string>
          </dict>
          <key>Processor</key>
          <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
