<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.put.uits.iMovie</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iMovie</string>
		<key>mas_action</key>
		<string>delete</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.put.uits.genericMASapp</string>
</dict>
</plist>
