<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string></string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.MSAutoUpdate</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>AutoPkgr</string>
        <key>VENDER</key>
        <string>Microsoft</string>
        <key>OS_REQUIREMENTS</key>
    		<string>10.13.x,10.12.x,10.11.x,10.10.x</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.MSAutoUpdate</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%-%version%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>pkg_path</key>
        				<string>%pathname%</string>
                <key>os_requirements</key>
        				<string>%OS_REQUIREMENTS%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
