<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>This uploads the latest excel update and builds a smartgroup and policy.</string>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.update.default.MSWord</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>Testing</string>
            <key>NAME</key>
            <string>Word_Update</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>Microsoft Word.app</string>
            <key>CATEGORY</key>
            <string>AutoPkgr</string>
            <key>POLICY_CATEGORY</key>
            <string>Updates</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/Default-Update-Office2016-PolicyTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>%NAME%</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/Default-Update-Office2016-SmartGroupTemplate.xml</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.darklordbrock.jss.put.MSWord2016</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
