<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the Audacity DMG.</string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.update.uits_ccl.audacity</string>
	<key>Input</key>
	<dict>
			<key>SITE_NAME</key>
			<string>UITS_CCL</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.update.default.audacity</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>policy_category</key>
						<string>%POLICY_CATEGORY%</string>
						<key>policy_template</key>
						<string>%POLICY_TEMPLATE%</string>
						<key>groups</key>
						<array>
								<dict>
										<key>name</key>
										<string>%GROUP_NAME%</string>
										<key>smart</key>
										<true/>
										<key>template_path</key>
										<string>%GROUP_TEMPLATE%</string>
								</dict>
						</array>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
