<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.install.UITS_CCL.TextWrangler</string>
	<key>Input</key>
	<dict>
			<key>NAME</key>
			<string>TextWrangler</string>
			<key>POLICY_CATEGORY</key>
			<string>Productivity</string>
			<key>SITE_NAME</key>
			<string>UITS_CCL</string>
			<key>POLICY_TEMPLATE</key>
			<string>%RECIPE_DIR%/UITS_CCL-Templates/UITS_CCL-Install_Once-PolicyTemplate.xml</string>
			<key>GROUP_NAME</key>
			<string>%NAME%</string>
			<key>GROUP_TEMPLATE</key>
			<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.install.default.TextWrangler</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>policy_category</key>
						<string>%POLICY_CATEGORY%</string>
						<key>policy_template</key>
						<string>%POLICY_TEMPLATE%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
