<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.update.uits_ccl.vlc</string>
	<key>Input</key>
	<dict>
		<key>SITE_NAME</key>
		<string>UITS_CCL</string>
		<key>POLICY_CATEGORY</key>
		<string>Updates</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.update.default.vlc</string>
</dict>
</plist>
