<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string></string>
	<key>Description</key>
	<string>Downloads the latest version of Oracle Java 8 JDK and creates a package. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.update.default.OracleJava8JDK</string>
	<key>Input</key>
	<dict>
		<key>SITE_NAME</key>
		<string>Testing</string>
		<key>DESCRIPTION</key>
		<string></string>
		<key>GROUP_NAME</key>
		<string>%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>%RECIPE_DIR%/UITS-Update-JavaJDK8-SmartGroupTemplate.xml</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/icons/OracleJava8.png</string>
		<key>POLICY_CATEGORY</key>
		<string>Updates</string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/Templates-default/UWM-Update-PolicyTemplate.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.put.OracleJava8JDK</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
