<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Create a package from the Audacity DMG.</string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.update.uits_pmk.VirtualBox</string>
	<key>Input</key>
	<dict>
			<key>SITE_NAME</key>
			<string>UITS_PMK</string>
			<key>POLICY_CATEGORY</key>
			<string>Updates</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.darklordbrock.jss.update.default.VirtualBox</string>
</dict>
</plist>
