<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.googlechrome</string>
    <key>Input</key>
    <dict>
      <key>VENDER</key>
      <string>Google</string>
      <key>NAME</key>
      <string>GoogleChrome</string>
      <key>CATEGORY</key>
      <string>AutoPkgr</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.pkg.googlechrome</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
