<policy>
    <general>
        <site>
          <name>%SITE_NAME%</name>
        </site>
        <name>%NAME% %SITE_NAME%</name>
        <enabled>true</enabled>
        <frequency>Once per computer</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <trigger_checkin>true</trigger_checkin>
        <trigger_enrollment_complete>false</trigger_enrollment_complete>
        <trigger_login>true</trigger_login>
        <trigger_logout>true</trigger_logout>
        <trigger_network_state_changed>false</trigger_network_state_changed>
        <trigger_startup>true</trigger_startup>
        <trigger_other>%SITE_NAME%-%NAME%-install</trigger_other>
    </general>
	<scope>
    <all_computers>true</all_computers>
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
		<!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
      <use_for_self_service>False</use_for_self_service>
      <!--<install_button_text>Install %VERSION%</install_button_text>
      <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description> -->

      <!--<self_service_categories>
        <category>
          <name>AutoPkgr</name>
          <display_in>true</display_in>
          <feature_in>false</feature_in>
        </category>
      </self_service_categories> -->
    </self_service>
</policy>
