<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Uploads the One Drive Package to JSS</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.jss.put.MSOneDrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OneDrive</string>
        <key>CATEGORY</key>
        <string>AutoPkgr</string>
        <key>VENDER</key>
        <string>Microsoft</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>ParentRecipe</key>
    <string>com.github.apettinen.download.MSOneDrive</string>
    <key>Process</key>
    <array>
      <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/OneDrive.pkg</string>
            </dict>
      </dict>
      <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/OneDrive.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/InstallRoot</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
     <dict>
        <key>Processor</key>
        <string>Versioner</string>
        <key>Arguments</key>
        <dict>
            <key>input_plist_path</key>
            <string>%RECIPE_CACHE_DIR%/InstallRoot/OneDrive.app/Contents/Info.plist</string>
            <key>plist_version_key</key>
            <string>CFBundleShortVersionString</string>
        </dict>
      </dict>
      <dict>
           <key>Arguments</key>
           <dict>
               <key>source_path</key>
               <string>%RECIPE_CACHE_DIR%/downloads/OneDrive.pkg</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/OneDrive-%version%.pkg</string>
               <key>overwrite</key>
               <true/>
           </dict>
           <key>Processor</key>
           <string>Copier</string>
       </dict>
      <dict>
          <key>Arguments</key>
          <dict>
              <key>pkg_path</key>
              <string>%RECIPE_CACHE_DIR%/OneDrive-%version%.pkg</string>
              <key>prod_name</key>
              <string>%NAME%-%version%</string>
              <key>category</key>
              <string>%CATEGORY%</string>
          </dict>
          <key>Processor</key>
          <string>JSSImporter</string>
      </dict>
    </array>
</dict>
</plist>
