<policy>
    <general>
        <site>
          <name>%SITE_NAME%</name>
        </site>
        <name>Firefox</name>
        <enabled>true</enabled>
        <frequency>Once every week</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
        <trigger_other>%SITE_NAME%-%NAME%-install</trigger_other>
    </general>
	<scope>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
		<!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
    <install_button_text>Install %VERSION%</install_button_text>
    <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
</policy>
