<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string></string>
        <key>Identifier</key>
        <string>com.github.darklordbrock.jss.install.psoa.iMovie</string>
        <key>Input</key>
        <dict>
            <key>SITE_NAME</key>
            <string>PSOA</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.darklordbrock.jss.install.default.iMovie</string>
    </dict>
</plist>
