<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Packages the Praat Download.</string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.put.Praat</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Praat</string>
		<key>VENDER</key>
		<string>Praat-</string>
		<key>CATEGORY</key>
		<string>AutoPkgr</string>
		<key>SCOPE</key>
		<string>All-8Auto-</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Praat</string>
	<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/%NAME%.app</string>
					<key>source_path</key>
					<string>%pathname%/%NAME%.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>app_path</key>
					<string>%destination_path%</string>
				</dict>
				<key>Processor</key>
				<string>PraatVersionFixer</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
							<dict>
								<key>group</key>
								<string>admin</string>
								<key>path</key>
								<string>Applications</string>
								<key>user</key>
								<string>root</string>
							</dict>
						</array>
						<key>id</key>
						<string>org.praat.Praat</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
					</dict>
					<key>pkgname</key>
					<string>%SCOPE%%VENDER%%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
				<dict>
            <key>Arguments</key>
            <dict>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>category</key>
                <string>%CATEGORY%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
			</dict>
		</array>
</dict>
</plist>
