<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VirtualBox, makes a pkg of it, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.put.VirtualBox</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>AutoPkgr</string>
		<key>NAME</key>
		<string>VirtualBox</string>
		<key>VENDER</key>
		<string>Oracle</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.sheagcraig.pkg.VirtualBox</string>
	<key>Process</key>
	<array>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>prod_name</key>
						<string>%NAME%-%version%</string>
						<key>category</key>
						<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
