<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.put.R</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>R</string>
		<key>VENDER</key>
		<string>R_Project-</string>
		<key>CATEGORY</key>
		<string>AutoPkgr</string>
		<key>SCOPE</key>
		<string>All-8Auto-</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<string>False</string>
		<key>version</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;a href="(?P&lt;filename&gt;R-(?P&lt;version&gt;[\d.]+)\.pkg)"&gt;R-[\d.]+\.pkg&lt;/a&gt;</string>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%SCOPE%%VENDER%%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>prod_name</key>
						<string>%NAME%</string>
						<key>category</key>
						<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
