<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string></string>
	<key>Identifier</key>
	<string>com.github.darklordbrock.jss.put.R</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>R</string>
		<key>VENDER</key>
		<string>R_Project-</string>
		<key>CATEGORY</key>
		<string>AutoPkgr</string>
		<key>SCOPE</key>
		<string>All-8Auto-</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;a href="(R-[\d.]+\.pkg)"&gt;R-[\d.]+\.pkg&lt;/a&gt;</string>
				<key>result_output_var_name</key>
				<string>filename</string>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>&lt;a href="R-([\d.]+)\.pkg"&gt;R-[\d.]+\.pkg&lt;/a&gt;</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://cran.r-project.org/bin/macosx/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Simon Urbanek</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
	        <key>Processor</key>
	        <string>FlatPkgUnpacker</string>
	        <key>Arguments</key>
	        <dict>
	            <key>flat_pkg_path</key>
	            <string>%pathname%</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/unpack</string>
	        </dict>
	    </dict>
	    <dict>
	        <key>Processor</key>
	        <string>PkgPayloadUnpacker</string>
	        <key>Arguments</key>
	        <dict>
	            <key>pkg_payload_path</key>
	            <string>%RECIPE_CACHE_DIR%/unpack/r.pkg/Payload</string>
	            <key>destination_path</key>
	            <string>%RECIPE_CACHE_DIR%/payload</string>
	        </dict>
	    </dict>
	    <dict>
	        <key>Processor</key>
	        <string>Versioner</string>
	        <key>Arguments</key>
	        <dict>
	            <key>input_plist_path</key>
	            <string>%RECIPE_CACHE_DIR%/payload/R.framework/Versions/Current/Resources/Info.plist</string>
	            <key>plist_version_key</key>
	            <string>CFBundleVersion</string>
	        </dict>
    </dict>
		<dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/*.pkg</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%SCOPE%%VENDER%%NAME%.pkg</string>
			</dict>
		</dict>
		<dict>
				<key>Arguments</key>
				<dict>
						<key>prod_name</key>
						<string>%NAME%</string>
						<key>category</key>
						<string>%CATEGORY%</string>
				</dict>
				<key>Processor</key>
				<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
